building_data = {
    '1': {
        'latitude': 47.2371429,
        'longitude': 39.7120693,
        'title': 'Главный корпус ДГТУ',
        'address': 'Площадь Гагарина 1'
    },
    '2': {
        'latitude': 47.238478,
        'longitude': 39.713201,
        'title': 'Учебный корпус № 2',
        'address': 'Проспект Михаила Нагибина 3А'
    },
    '345': {
        'latitude': 47.238259,
        'longitude': 39.709702,
        'title': 'Учебные корпуса № 3, 4, 5',
        'address': 'Площадь Гагарина 1'
    },
    '6': {
        'latitude': 47.238595,
        'longitude': 39.712325,
        'title': 'Учебный корпус № 6',
        'address': 'Проспект Михаила Нагибина 3'
    },
    '7': {
        'latitude': 47.238327,
        'longitude': 39.712363,
        'title': 'Учебный корпус № 7',
        'address': 'Проспект Михаила Нагибина 3Г'
    },
    '8': {
        'latitude': 47.237870,
        'longitude': 39.710904,
        'title': 'Учебный корпус № 8',
        'address': 'Площадь Гагарина 1'
    },
    '10': {
        'latitude': 47.249213,
        'longitude': 39.757497,
        'title': 'Учебный корпус № 10',
        'address': 'ул. Площадь Страны Советов 1'
    },
    '11': {
        'latitude': 47.251117,
        'longitude': 39.655095,
        'title': 'Учебный корпус № 11, ВУЦ, Корпус "Наука"',
        'address': 'ул. Шаповалова 2'
    },
    '21': {
        'latitude': 47.223889,
        'longitude': 39.732162,
        'title': 'Учебный корпус № 21',
        'address': 'ул. Социалистическая 162'
    },
    '22': {
        'latitude': 47.223327,
        'longitude': 39.731610,
        'title': 'Учебный корпус № 22',
        'address': 'ул. Социалистическая 162'
    },
    '24': {
        'latitude': 47.223295,
        'longitude': 39.732904,
        'title': 'Учебный корпус № 24',
        'address': 'ул. Социалистическая 162'
    },
    '25': {
        'latitude': 47.223479,
        'longitude': 39.734748,
        'title': 'Учебный корпус № 25',
        'address': 'ул. Социалистическая 162'
    },
    '26': {
        'latitude': 47.223522,
        'longitude': 39.732793,
        'title': 'Учебный корпус № 26',
        'address': 'ул. Социалистическая 162'
    }
}
registration_username = ""  # Глобальная переменная для хранения логина при регистрации
registration_password = ""  # Глобальная переменная для хранения пароля при регистрации

entrance_username = ""  # Глобальная переменная для хранения логина при входе
entrance_password = ""  # Глобальная переменная для хранения пароля при входе

building_number=""
room_number=""

all_info=""
cntseats=""
cntcomputer=""
cntprojector=""
cntsockets=""

access=0  # Модификатор доступа